Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 江如龙瞬间醒悟过来，江逸刚才不是不小心……而是故意的，这一切都在他算计之中，他此刻抱着江如虎，因为冲得太猛，加上江如虎朝前方的冲力让他重心不稳，战力大打折扣，江逸偷袭的时机把握的太好了……
en_us: Jiang Rulong suddenly come to realize that Jiang Yi wasn't careless... but it was intentional; everything was within his plans. He who was carrying Jiang Ruhu lost his center of gravity due to the himself doing a vigorous dash and coupled with the speed of Jiang Ruhu. He had lost a huge portion of his combat strength and it was now a great opportunity for Jiang Yi to sneak in an attack...

source: 江如龙脸上都是冷汗，但他还来不及擦心里却陡然一凛，他感觉到一股凌冽的杀机锁定了他，他目光猛然一扫却利马一缩，因为一个拳头已经在他眼眸内开始无限放大……
en_us: Jiang Rulong's face was covered in cold sweat. Before he even had time to recover from the shock, he felt a sharp killing intent locking onto him. He turned around for a scan but instead shrank his eyes, because a fist was expanding indefinitely in his sight...

source: 江如龙身高足足有七尺，整整高江逸江逸两个头，身子也魁梧如一头暴熊，他和江如虎不一样，浑身都是虬结的肌肉，方头大耳，光看外表就知道是一名猛汉。
en_us: Jiang Rulong was seven feet tall and was two heads taller than Jiang Yi. His body was that of a violent bear, it was entirely different from plump Jiang Ruhu and was packed with firm muscles. He had a square face and large ears; just from his appearance, it was safe to say that he was a fierce fighter.

source: 江家东院，管事房。
en_us: Jiang Residence Eastern Court, Housekeeping Chamber.

source: 江家子弟很多，直系的有二十多个，旁系的那就更多了，类似江如虎这类旁系子弟足足有上百个，不过真正的优秀天才子弟，肯定不会出现在演武殿。
en_us: The Jiang Clan had many descendants; the direct lineage consisted of more than twenty members while the collateral lineage had even more. There were at least over a hundred collateral lineage descendants like Jiang Ruhu. Those truly prodigious descendants would definitely not be appearing in the Martial Arts Demonstration Hall.

source: 江家年轻一代中身份最尊贵的，自然是拥有各种血缘关系的少爷，其次才是没有血缘关系的普通子弟。其中像大少爷这样的直系血统少爷，以及极少数天资卓越的旁系少爷，无疑是最上层的存在。而江如虎等人，作为旁系少爷而言，天资一般，所以在江家子弟中的地位属于第二等。
en_us: The most respected members of the youngest generation in the Jiang Clan were naturally the sons with blood relations—direct and indirect—to the main Jiang bloodline. Relatives with no blood ties were deemed secondary. As a result, the top echelon was comprised of direct descendants as well as a tiny minority of highly talented relatives from branch families. Those from a branch family and of average ability, like Jiang Ruhu, possessed less status.

source: 江家族规森严，因触犯族规被活活打死的子弟也不在少数，江逸心里想着炼丹房的事情，一时忘记了令牌的事情，但此刻也只能强装镇定，转头惭愧说道：“荣管事，不好意思，我放家里忘记带了……”
en_us: The Jiang Clan rules were strict, and the number of clan members who were beaten to death for breaking these laws was not small. Jiang Yi's mind was focused on the events that happened in the alchemy lab that he had forgotten his issues with the command token. Despite this, at the moment he could only pretend to be calm and composed. Turning his head, he shamefully said, "Chief Rong, I am sorry. I left it at home and forgot to bring it out..."

source: 江家有一门武技叫幻影拳，本质上和这暴雨拳差不多，幻影拳江逸已经感悟到大成的地步了，拳影比这翊凌雪真实多了，此刻翊凌雪又怎么能伤他？
en_us: The Jiang Clan had a martial arts technique called Phantom Punch, which in essence was not much different from this Thunderstorm Fist. Jiang Yi could feel that his mastery of Phantom Punch had hit Phenomenal Stage, with his fist silhouettes being more concrete and realistic that what Yi Lingxue could produce. How could Yi Lingxue possibly harm him at that moment?

source: 江家西山药田种植的主要是一种能够补血的药草，草参。草参是一种九品灵草，虽然品级最低，但好歹挤进了灵药的范畴，这就不是普通百姓消费得起的了。事实上，江家以草参为主要材料制作出来的疗伤药补血丸，主要供给的对象除了家族子弟和外面的武者外，还有就是军队里的军官。
en_us: The main crop being produced in the Western Hills was grass ginseng, a type of spirit herb that could boost and enrich the blood. Winter ferula was a ninth-grade spirit herb—even though this medicinal plant was of the lowest grade in quality, as the plant was considered a type of spirit herb, normal civilians could not afford to purchase this herb. Frankly speaking, the medicine produced by the Jiang Clan used grass ginseng as its primary ingredient. It was used heal wounds and improve blood quality and was mainly provided to descendants of the Jiang Clan, martial artists not within the family, as well as soldiers of the state army.

source: 江家西院的一个破败小院内，门突然被撞开，差点没能坚持到家的江逸踉踉跄跄、跌跌撞撞地挨进了门。他眉头紧蹙，眸子内都是痛苦之色，嘴角还留有残余的血迹。
en_us: A loud crash sent the door leading to the tiny dilapidated courtyard flying. Jiang Yi staggered through the doorway, swaying left to right. He barely had enough energy left to even make it back to his house. Jiang Yi’s eyes betrayed his great agony, and his brows were furrowed deeply. The corners of his mouth were flecked with dried blood.

source: 江家这些年不待见他，江逸骨子内有一股傲气，不想依靠江家。而且因为柳长老的事情，不到最后关头，他实在不想让江家知道他拥有黑色元力的事情。
en_us: All these years, the Jiang Clan did not see him in a positive light. Jiang Yi himself had a sense of haughty pride within his bones, and refused to depend on the Jiang Clan. Additionally, due to the situation with Elder Liu, he truly had no desire of letting the Jiang Clan know of the case that he possessed black essence force until the very last moment.

source: 江小奴一下慌了，连忙跟着跪下来，一张脏兮兮的小脸上都是心疼和愧疚，说着说着泪水又趟了下来。
en_us: Jiang Xiaonu hastily knelt down, her small, grimy face showing her heartache and regret. Tears rolling down her cheeks as she spoke.

source: 江小奴一愣，眨了眨眼，迷糊的说道：“坑我？我有什么好坑的？我又没钱……”
en_us: Jiang Xiaonu stared blankly, blinking from time to time, replying in a daze, "Scam me? What's there to cheat from me? I'm broke..."

source: 江小奴从小最听江逸的话了，关心的问了几句就一瘸一拐的走出去了，烛光下的瘦弱背影好生可怜……看得江逸又是一阵心疼。
en_us: Jiang Xiaonu had obedient to Jiang Yi ever since she was young. After asking a few questions out of concern, she limped out of the house. The weak, skinny figure in the candlelight looked most pitiful... giving the observing Jiang Yi much heartache.

source: 江小奴小鸡啄米的点头，却依旧哭着说道：“可是……少爷，一个月我们上哪去赚十两紫金啊？哎呀，都是小奴不好，连累少爷了……”
en_us: Jiang Xiaonu nodded her head rapidly like a chicken pecking rice off the ground, but continued crying. "But...Young Master, how are we ever going to earn ten taels of purple gold in a month? Ah, it's all Xiaonu's fault; she has put her burdens on Young Master..."

source: 江小奴心思单纯倒是没多想，反而替江逸高兴，毕竟武殿那可是大地方，在她看来在武殿做事，那肯定是做大事，殊不知江逸在里面做的是最低等的陪练……
en_us: With a simple and naive personality, Jiang Xiaonu did not think too much about what Jiang Yi said, and instead felt happy for him. After all, the Martial Arts Hall was a big place. In her view, working for the Martial Arts Hall definitely meant that he was doing great things. She scarcely realised what Jiang Yi was employed inside for was being the lowest-grade sparring partner...

source: 江小奴抓了抓头，小脸都是尴尬之色，连忙转身又一瘸一拐走出去。
en_us: Jiang Xiaonu scratched her head, her small face filled with a look of awkwardness, before hastily turning around and hobbling out.

source: 江小奴担忧江逸一个人在家，想早点做完好回家也就没想那么多了，跟着那老妈子提着一大桶衣物走进内堂，结果刚刚进去却被一名护卫“不小心”绊了一下，“恰好”撞到墙边的一张桌子，而桌子上“正好”放着一副重金购买回来的“名画”。
en_us: Jiang Xiaonu was worried about leaving Jiang Yi all alone at home and wanted to finish her work early to go home as soon as possible—as such, without thinking too much, carrying a large pail of clothes she followed the old chambermaid into the Inner Court. As a result, she had only just entered the room when a guard "accidentally" caused her to trip, and she "coincidentally" crashed into a table by the wall, placed upon which "as it turned out" was a "famous artwork" purchased using much gold.

source: 江小奴拍了拍胸口，咧嘴憨笑道：“我还以为是什么大事呢，少爷你去吧，小奴没事的，我能自己照顾自己！少爷以后也要经常做大事的呀，总是会外出的呀。”
en_us: Xiao patted her chest, mouth curving into a guileless smile, "And here I thought it was something severe. Go ahead, Young Master, Xiaonu will be fine. I can take care of myself! Young Master will do great things in the future, and will have to venture out after all."

source: 江小奴捧着一个白色小瓷瓶和一碗清水很快进来了，放在床边问道：“少爷，现在吞服丹药吗？还是先吃点东西？哎呀……少爷你中午也没吃吧？要不我先去下两碗面条？”
en_us: Jiang Xiaonu walked in shortly after, carrying a small white porcelain bottle and a bowl of clear water. "Young Master,” she said as she put the items on the bedside table, “do you want to take the elixir now? Or do you want to eat something first? Oh no... Young Master, you haven't eaten lunch yet, have you? Do you want me to go prepare two bowls of noodles first?"

source: 江小奴每隔五天就会和春芽去风月楼做工，帮忙清洗楼子内的姑娘换下的衣物和床单，本来她们一直都在后院做工，从不准去前院和内堂，江小奴生性老实更不会擅自乱跑。
en_us: Jiang Xiaonu would go to Fengyue Brothel with Chunya every five days to work, wherein she helped to wash the clothes and linen changed out by the ladies of the manor. Usually, they worked in the backyard and was never allowed to go to the front yard nor the inner court. Xiaonu's honest personality also ensured that she would not run all over the building on her own accord without permission.

source: 江小奴的大喊提醒了江逸，他立即以最快的速度调集了一丝黑色元力，朝拳头内涌去，和拳头内的蓝色元力融合起来。
en_us: Xiaonu's yell reminded Jiang Yi of his weakness, and he immediately mustered a wisp of black essence force at his fist and fused it with the blue essence force.

source: 江小奴眨了眨眼睛，看着自家少爷，眸子内都是迷茫之色，这是他家的少爷吗？他家少爷怎么那么厉害了……
en_us: Jiang Xiaonu blinked her eyes and looked at her young master. Her eyes clouded with confoundment. Was this her young master? How did Young Master become so powerful…?

source: 江小奴眼中都是焦急，咬牙说道：“可是，一个月后要是交不出钱，风云楼的人上门要钱，刑堂肯定会责罚少爷的，小奴被打死没事，少爷……”
en_us: Jiang Xiaonu's eyes revealed all her anxiety. Gritting her teeth, she responded, "However, if we cannot settle the debt within a month, should the people from Fengyue Brothel come here demanding for money, the Disciplinary Court would definitely punish Young Master. It's alright if Xiaonu gets beaten to death, but Young Master..."

source: 江小奴穿着一身米白色的宽大侍女袍，将她的身子衬托得更加羸弱，听到江逸的声音，看到一道身影飙射而来，顿时大喜道：“少爷，可把你给找到了，担心死我了。”
en_us: The wide rice-white maidservant's robes made Jiang Xiaonu's figure appear even frailer. Hearing Jiang Yi's voice and seeing a figure flying towards her, she immediately smiled and said, "Young Master, I've finally found you! I was worried sick."

source: 江小奴笑着点头，看不出半点不舍，只是关切的说道：“少爷一定要小心哦，等你回来我给你包饺子吃。”
en_us: Jiang Xiaonu nodded smilingly. She expressed only concern at Jiang Yi's departure, and not a trace of reluctance, "Please be careful, Young Master. I will be sure to make you dumplings when you are back."

source: 江小奴自小和江逸一起长大，两人心灵相通配合默契，这一喊小奴立即反应过来，松开了抱住对方左脚的双手，而江逸一记飞腿恰好飞来，将这铸鼎境三重的武者重重踹飞出去。
en_us: Having grown up with Jiang Yi since a young age, Jiang Xiaonu was deeply in sync with Jiang Yi in mind and spirit. This single shout made Xiao Nu immediately respond in kind — by releasing her hands from their opponent's left foot. At the same time, Jiang Yi sent a flying kick sweeping in, sending this martial artist at the third stage of the Cast Tripod Realm flying back.

source: 江小奴被江逸撞到，后脑勺在地上磕碰了一下，痛得叫了一声。不过她反应很快，看那名护卫继续冲去又要攻击江逸，竟身子一扑用双手死死抱住那护卫的一条腿，同时大喊道：“少爷，别管我，快跑！”
en_us: Jiang Yi collided into Jiang Xiaonu. She cried out in pain as she knocked the back of her head against the ground. Thankfully, however, her reaction was fast. Seeing the guard continuing to charge forward and attack Jiang Yi once again, she pounced forward and firmly clung to one of the guard's legs. At the same time, she shouted, "Young Master, don't worry about me! Just run!"

source: 江小奴连忙出去取肉干，她以前经常出去做工，怕江逸饿到所以准备了一些肉干，此刻倒是正好派上用场。
en_us: Jiang Xiaonu hurried went to retrieve the jerky. She used to regularly head outside to work and had prepared some jerky lest Jiang Yi got hungry. At this moment, the jerky could be put to good use.

source: 江小奴连忙述说起来，把今天的事情详详细细的说了一遍，说完之后才继续迷糊的问道：“少爷，有问题吗？”
en_us: Jiang Xiaonu promptly recounted in detail all the events that happened that day once. When she was finished with her recounting, she asked in continued confusion, "Young Master, do you have any questions?"

source: 江小奴追了出来，站在院门目送着江逸离开，不断的挥着手，小脸上还露出甜甜的笑容。
en_us: Jiang Xiaonu followed Jiang Yi and stood at the gates watching him leave, steadily waving goodbye with a sweet smile on her small face.

source: 江小奴醒悟过来，甜甜一笑，满眸都是崇拜，她顿了一下把紫金还给江逸道：“少爷，这紫金你收着吧，我拿着怕是睡觉都睡不着了，对了…少爷你的封印是怎么破开的？”
en_us: Jiang Xiaonu came to her senses. Smiling sweetly, her face was filled with a look of adoration. She immediately returned the purple gold to Jiang Yi, saying, "Young Master, I think you should keep the purple gold. If I were to take it, I'm afraid I wouldn't be able to sleep. Oh yes... how did you break your seal, Young Master?"

source: 江恨水扫了一眼江如虎，淡然说道：“我去拿吧，江逸，你回头和柳长老告罪一声，我赶着去武殿！”
en_us: Jiang Henshui glanced at Jiang Ruhu, before indifferently replying, "I'll go get it. Jiang Yi, you can report to Elder Liu about my offense later. I am rushing to the martial arts hall!"

source: 江恨水没想到江逸态度转变得如此之快？有些不适应，不过看了一眼背后江如虎他也没说什么，摆了摆手道：“江逸，你现在在炼丹房做事了？那给我拿一百枚灵神丹吧，我最近要去武殿内闭关，冲击一下铸鼎境第九重。”
en_us: Jiang Henshui did not expect Jiang Yi's attitude to change so quickly. He was not familiar with such circumstances, yet said nothing as he eyed Jiang Ruhu behind him. Instead, he waved his hand and responded, "Jiang Yi, are you working at the alchemy lab now? How about you help me retrieve a hundred Spirit Pills, then? I am going into seclusion at the martial arts hall, to train up to the ninth stage of the Cast Tripod Realm."

source: 江松一惊却并不慌乱，在他看来江逸只有铸鼎境一重，就算武技再巧妙纯熟也绝不是他的对手。他境界比江逸高一重，反应速度，攻击速度和力量相差一截，他怎么会输？他冷笑一声也不去管双手了，右腿膝盖上元力灌注，对着江逸的裆部猛然顶去。
en_us: Jiang Song was astonished but did not become flustered. As he could see, Jiang Yi was only at the first level of the Cast Tripod Realm. As such, no matter how ingenious or skillful he was in martial arts, he was clearly not his match. His level was higher than Jiang Yi by one stage. Their reaction speeds, attack speeds and strengths all differed by an entire notch. How could I possibly lose? Jiang Song laughed coldly as he ignored the condition of his hands, instead applying his essence force on his right kneecap, before abruptly hitting upwards, aimed at Jiang Yi's crotch.

source: 江松一看情况不对，扭头就往侧门跑，还不跑那就等着断腿了。江顾水和江如狼不出头，江如虎这点实力他可不敢指望，只要跑出去一喊，江逸已经出手伤人肯定会被刑堂治罪的。
en_us: Seeing that the situation was going awry, Jiang Song turned and ran towards the side door. It would be equivalent to having his leg broken if he didn't try to escape. Jiang Gushui and Jiang Rulang wasn't going to interfere, neither could he rely on Jiang Ruhu's strength. As long as he ran out to shout that Jiang Yi injured someone, Jiang Yi would definitely be punished by the Disciplinary Court.

source: 江松两掌刚刚拍来，江逸身子因为陡然后仰，他两只手掌只能拍空了。而当他准备变招朝下方拍下时，江逸两只手已如两根海藻般缠了上来，轻松把他的两只手抓住缠上。
en_us: Jiang Song's two hands had just flown downwards, yet as Jiang Yi's body abruptly bent backward, his hands could only hit the air. As for the moment he was ready to change techniques and hit downstairs, Jiang Yi's hand had coiled together like two threads of seaweed, easily entangling his hands in turn.

source: 江松也是旁系少爷，天资不行又懒惰好玩，现在才是铸鼎境二重。他父亲求了柳长老多次才把他安排进来，本意是想让他学些炼丹术，日后好谋生。
en_us: Jiang Song was also a collateral descendant. He had a lack of talent and was naturally very lazy; as such, his abilities were only at the second level of the Cast Tripod Realm. His father had begged Elder Liu many times before he could successfully arrange for his son to work there. His father's goal had been to let him learn the skill of elixir-refining so that he would have the skills to survive in the future.

source: 江松昨天被他父亲打了一顿，训斥了很久，也有些后悔了，至少……在这里干活，他可以经常弄些丹药出去卖钱。所以今日他思前想后，决定厚着脸皮来赔罪，就算给柳长老下跪也要留下来。
en_us: Jiang Song had been beaten up by his father and had received a long scolding. Furthermore, he was somewhat regretful after the whole incident. At least... working there meant he could regularly produce elixirs and sell them outside. Thus, after much pondering that day, he decided to be more thick-skinned and went over to apologize, even if it meant he had to kneel to Elder Liu, he would stay.

source: 江松气得浑身颤抖，脸上肌肉都扭曲起来，他眼中突然闪过一丝狠色，爆喝道：“看我把你打残废了，柳长老还怎么用你？哼哼，到时候我在让我父亲来求求柳长老，这个位置还是我的。”
en_us: Jiang Song was so furious that his entire body was shaking. With the muscles on his face twitching, a look of viciousness flashed past his eyes. "Let's see how Elder Liu can still use you when I make you handicapped!" he roared. "Hmph! At that time, I will make my father come to beg Elder Liu—by then, the position will still be mine."

source: 江松痛嚎一会，额头上都是冷汗，他满脸扭曲艰难爬起来，眸子内都是惊骇迷茫之色，似乎到现在还不敢相信，自己铸鼎境二重的实力，怎么如此轻松被江逸这个铸鼎境一重的废物给伤了？
en_us: Jiang Song howled in agony for quite a while. His forehead was filled with cold sweat. As he tried with much difficulty to lift himself up, his face twitched and his eyes were filled with bewilderment and terror. Even now he couldn't believe that he had been thrashed by a useless person at the first stage of the Cast Tripod Realm like Jiang Yi.

source: 江松的想法理论上没错，不过他不知道江逸此刻左眼视力变得恐怖，他的一举一动全被江逸看眼里。他还没动江逸已经提前判断出他的攻击轨迹了，力量和攻击速度虽然有差距，但是……反应速度比他快了很多。
en_us: Jiang Song's thinking was not wrong in theory, but he did not know that Jiang Yi's left eye at that moment had obscenely powerful eyesight. As such, his every move and action were all caught by Jiang Yi. Before he had even moved, Jiang Yi had already predicted in advance his attack trajectory. Although there was some difference in power and attack speed... Jiang Yi's response speed was much faster than him.

source: 江松看了江逸一眼顿时怒了，指着江逸的鼻子骂道：“你分明是故意的，对了！昨日我上茅房回来你就在这里，一定是你向柳长老告状了，他才会如此暴怒的。江逸你好毒啊，想不到平时看你老实巴交的，却是十足的阴险小人。”
en_us: Jiang Song glanced at Jiang Yi and instantly fell into a deep rage. Pointing straight at Jiang Yi's nose, he shouted angrily, "You clearly did this on purpose, yes! Yesterday, while I was in the toilet, he was right here! It must be you who told on me to Elder Liu, that's why he became so angry. Jiang Yi, you're evil! I didn't expect you, someone who usually looks so honest and trustworthy, to be such a treacherous vile person."

source: 江松脸色瞬间大变，眸子内都是惶恐和怒意。昨日他被柳长老扫了一巴掌，回到家中和他父亲一说，却又被狠狠打了一顿，让他今日立即过来给柳长老赔礼道歉，得到柳长老的原谅，好继续留在这炼药房干活。
en_us: Jiang Yi's expression changed instantly, his eyes becoming filled with horror and rage. He had received a tight slap from Elder Liu the day before; worse, when he got home and informed his father, he received yet another vicious beating. His father ordered him to immediately return that day and apologize or make amends with Elder Liu, to in turn receive forgiveness from the elder and allow him to continue working at the alchemy lab.

source: 江松说的虎哥，自然是家族二等子弟中的老大，江如虎！江如虎的父亲是内务堂大总管江云蛇，还有一个哥哥江如龙在家族年轻一代中战力排名第二，仅在江家大少爷江恨水之下。有父亲和哥哥罩着，加上本身实力达到铸鼎境四重，江如虎自然混得风声水起，江家的很多旁系少爷和二等子弟，像江豹江松等人都唯他马首是瞻。
en_us: The "Brother Hu" mentioned by Jiang Song referred naturally to Jiang Ruhu, the leader amongst the second-tier descendants of the family! Jiang Ruhu's father was Jiang Yunshe, the chief supervisor of the internal affairs department. He also had an elder brother called Jiang Rulong, who was positioned second in the list of most powerful persons within the young generation of the family; furthermore, his position was right below the Jiang Clan's great young master, Jiang Henshui. With such a father and elder brother protecting him, and adding his strength at the fourth level of the Cast Tripod Realm, Jiang Ruhu naturally commanded a powerful, respected and renowned position. Many Jiang Clan collateral descendants and second-tier descendants, like Jiang Bao and Jiang Song, followed his lead.

source: 江豹万万没有想到这个素来还算老实的家伙此番犯了混，居然敢主动攻击自己？脸上顿时浮现出慌乱的神色。他此刻左手受了重伤，不断传来撕裂般的痛苦已经折磨得他够呛了，哪里还能还手？当下也只能抱着左手在地面上挪来蠕去，搞得异常狼狈。
en_us: Jiang Bao did not expect this ever-honest fellow would rebel, let alone attack! He panicked for a moment. His left arm was already seriously injured and sent waves of unbearable pain coursing through his body. Jiang Bao had lost all ability to fight back. He could only cradle his left arm and roll on the floor like a pathetic wretch.

source: 江豹和江松一听急了，不过看到江如虎淡淡扫过来一眼中的莫名意味，两人立即懂了，嘿嘿直笑起来。江逸从他们跨下爬过的时候，不是最好的偷袭机会吗？江如虎根本就没打算放过江逸，只是想多羞辱一下他罢了……
en_us: Jiang Bao and Jiang Song felt anxious upon hearing Jiang Ruhu's offer. However, seeing the ineffable meanings hidden in Jiang Ruhu's gaze as his eyes slightly swept across them, the two person immediately understood his aim and started laughing mischieveously. Was it not the best opportunity to launch a sneak attack whilst Jiang Yi was crawling between their legs? Jiang Ruhu had completely no intention to let off Jiang Yi, but rather he desired to humiliate Jiang Yi even further...

source: 江豹脸色一沉，眼中凶光一闪，爆喝一声，身子一跃而起，右拳红色灵力环绕，宛如一道流星般划破长空，对着他的脑袋狠狠砸来。
en_us: Jiang Bao looked down and paused. Suddenly, without warning, with an ominous glint in his eyes and a loud roar, he jumped up into the air, a red-colored energy ball revolving around his right fist. Akin to a shooting star streaking across the vast night sky, he viciously punched at Jiang Yi’s head.

source: 江豹逃出去几步，后背传来一股巨力，他狂喷一口鲜血，身子朝前方扑去，他顾不得身体内的疼痛，惊恐的大叫起来：“三公子，狼哥，你们还不出手吗？再不出手我要被打死了。”
en_us: After Jiang Bao tried to escape, a giant force was felt from behind. He regurgitated a mouthful of fresh blood and fell forward. He couldn't be bothered with the pain and shouted with fear, "Third Young Master and Brother Lang, are you guys still not going to step in? Anymore and I would be beaten to death."

source: 江逸一个拳头轰然砸在刘管事的一只手掌上，一股巨力传来，刘管事的身子猛然被震退，根本无法抵挡。
en_us: Jiang Yi slammed a fist against Housekeeper Liu's arm, the tremendous shockwave that came from it caused Housekeeper Liu to abruptly stagger back, completely powerless to defend himself.

source: 江逸一听顿时气不打一处来，昨日暴打他的人中，就数这江豹下手最毒，他头上那个至今还在高高肿起的大包就是对方的杰作。而且今日话还没说上两句，这厮就再次动手，还动用大杀招流星拳，这是想再次把他毒打至昏死甚至要人命啊……
en_us: Jiang Yi couldn’t help but feel angry. Among those who beat him up yesterday, Jiang Bao was the one who delivered the most vicious blows. The huge bruise on his head was the latter's creation. Furthermore, today he started beating on him even before he could utter a word. The Shooting Star Punch was one of his most powerful trump cards. He must have wanted to beat me unconscious. Perhaps… he even meant to kill me!

source: 江逸一屁股坐到地上，这一炉丹药可是数量不少，最少有五十枚，最重要的是还是人阶上品的灵神丹！他听说这人阶上品丹药在外面卖，一枚最少是十两银子，换句话说如果里面的丹药全炸了，他就毁掉了五两紫金的丹药……
en_us: Jiang Yi fell to the ground, landing on his buttocks. The number of elixirs in the cauldron was not small—there were at least fifty pills, and most importantly they were Man-tier superior-grade Spirit Pills! He had heard hearsay that this Man-tier superior-grade elixir was sold outside for at least ten taels of silver per pill. In other words, if all the elixirs in the cauldron exploded, he had instantly destroyed elixirs worth five taels of purple gold...

source: 江逸一巴掌扫过去，把小胖子打得在原地转了一个圈，他正色说道：“钱万贯，要想和我江逸做朋友，你就收起这点小聪明，我最讨厌虚伪的人。”
en_us: Jiang Yi slapped Fatty so hard that he spun an entire round on the spot. He said in a stern manner, "Qian Wanguan! Stop this pretentious nonsense if you want to be friends with me. Pretentious people are what I hate the most."

source: 江逸一巴掌拍在小胖子后脑勺，怒道：“再说这些屁话，信不信我把你丢进茅厕内？”
en_us: Jiang Yi slapped the back of Fatty's head, and raged,“If you dare mention these nonsense ever again, don't blame me for throwing you into the toilet.”

source: 江逸一张脸变成了苦瓜，转念一想，这柳长老既然在后面看着，想然自己取的药材是没错了。
en_us: Jiang Yi's face changed to show his bitterness. However, on second thoughts, he realized that since Elder Liu had been observing behind his back, it was clear that going to pick up the medicine himself was the right move.

source: 江逸一怔暗道晦气，内心有些惊疑起来，最近天羽城内发生了什么大事吗？怎么这些公子小姐全去武殿内修炼了？
en_us: Jiang Yi was startled and swore under his breath at his wretched luck. He was slightly bewildered. Did some major event happen in Skyplume City? Why were all these gentlemen and ladies of big families heading to the Martial Arts Hall to cultivate?

source: 江逸一怔，立即醒悟过来，自己好像带着是苍狼面具？连忙起身朝练功房内走去，在门口却下意识回头一扫，却看到所有陪练的目光中都是默哀之色……
en_us: Jiang Yi was startled, but quickly came to his senses. Was he himself not the person wearing a wolf mask? He hastily stood up and walked into the technique-practicing room. At the door, however, he made the decision to turn back and scan the room, but all he could see were the gazes of all the remaining sparring partners seemingly observing a moment of silence in tribute of Jiang Yi.
